---
kind: property
id: P:Autodesk.Revit.DB.ACADExportOptions.ExportOfSolids
source: html/bdce5da4-9a31-9be7-4d31-5dad2bc27c43.htm
---
# Autodesk.Revit.DB.ACADExportOptions.ExportOfSolids Property

The mode used to export solids in 3D views.
 Default value is SolidGeometry.Polymesh.

## Syntax (C#)
```csharp
public SolidGeometry ExportOfSolids { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration